{'CSCI 2960': {'Name': 'RCOS', 'CRNs': '19723 (1cr), 19830 (2cr), 19891 (3cr), and 19906 (4cr)', 'Instructors': 'Turner, Goldschmidt', 'Prerequisites': 'CSCI 1700 or CSCI 2700 or CSCI 1200 or CSCI 2200', 'Credits': '1 to 4 (corresponding to sections 01-04)', 'Description': 'RCOS (Rensselaer Center for Open Source) is an eclectic group of undergraduate students that embark on individual and team-based open source projects, primarily software, but also open hardware projects. Many new projects are introduced each semester, though many ongoing and "higher-profile" projects are also undertaken. Overall, students are required to work on and contribute to open source projects, in particular through multiple commits (commit early, commit often), maintaining a blog, presenting their work and/or specific technical talks, mentoring other projects, etc. This project-based "course" may be taken multiple semesters, with grades based on clear effort and contributions rather than a project that meets all of its requirements.'}, 'CSCI 4960': {'Name': 'INTRODUCTION TO RESEARCH', 'CRNs': '19478, 20017', 'Instructor': 'Keshan', 'Prerequisites': 'CSCI 2200', 'Concentration Areas': 'none', 'Credits': '4', 'Description': "This course is designed to introduce students to the key aspects of CSCI inter-domain research. The course's goal is to make students aware of the technicalities related to formal research and to assist students in overcoming any common misconceptions that may exist. By completing this course, students will be able to conduct research in a more systematic and formal manner from the start."}, 'CSCI 4961': {'Name': 'INTRODUCTION TO QUANTUM COMPUTING', 'CRNs': '19550', 'Instructor': 'Liu', 'Prerequisites': 'CSCI 2300', 'Concentration Areas': 'Theory, Algorithms, and Mathematics', 'Credits': '4', 'Description': "Building on a foundation of computing (CSCI 2200) and algorithms (CSCI 2300), this course delves into such fundamental principles as qubits, superposition, entanglement, quantum gates, and algorithms. Students will engage in hands-on lab sessions using Qiskit and/or AWS/Azure cloud services, exploring both quantum and classical simulations of quantum circuits. Students will also explore potential applications in optimization and machine learning, with discussions on the latest in quantum hardware, including Google's Sycamore circuits. Learning objectives include a solid grasp of quantum computing principles, an understanding of quantum advantages (including the quantum supremacy in the NISQ era), proficiency in reading and analyzing simple quantum algorithms, and insights into practical applications."}, 'CSCI 4963': {'Name': 'APPLICATION PROG USING JAVA ==>  4330', 'CRN': '19551', 'Instructor': 'Kuzmin', 'Prerequisites': 'CSCI 2300 and CSCI 2600', 'Concentration Area': 'Systems and Software', 'Communication-Intensive (CI) Course': 'YES', 'Credits': '4', 'Description': 'Java is one of the most popular general purpose modern programming languages used in industry. This course focuses on learning and practicing advanced Java features that are widely used in industry and academia. The first part of the course is dedicated to object-oriented features of Java and how to use them in software design. It also covers all major tools that support the development process during the entire software development life cycle. The second part of the course covers parallel programming, how it can be implemented in Java, its advantages and limitations. The third part of the course is dedicated to creating Web applications. Finally, the fourth part of the course discusses different database models and provides specific details on how to create Java applications that can use different databases as a data storage option. Special attention is given to noSQL graph databases that, combined with Java, allow building solutions that are capable of storing, manipulating, and analyzing billion-node scale networks.'}}